{
    "name": "Huang Desang",
    "autobiography": "I was born in Chiayi City, where it felt like a big family and the neighborhood was friendly. Before that, I worked as an operator in a company called Guanghuan Technology in Hsinchu Science Park. Because of the good salary, I stayed there for 5 years, but things changed when the company had to make major decisions about its operations, resulting in layoffs, and unfortunately I was one of them, so I took the opportunity to re-examine my role in the company. I developed a passion for programming during my college studies. Through a friend’s introduction, I discovered the Information Technology Association and decided to join their app development class. Through self-study and professional training, I was fortunate enough to make great progress in programming. I became the leader of a group and helped my classmates overcome challenges. During this period of study, I was able to integrate various skills and complete various projects. After graduation, I had the opportunity to work on a project with my classmates and learned a lot of professional knowledge. . I currently have more than 3 years of experience as an App engineer. Due to company requirements, I am proficient in Android and iOS development. The products I work on need to integrate Bluetooth and WiFi, so I also implement a lot of Internet of Things (IoT) development technologies. I also need to develop libraries for customers as part of the product. The past three years have taught me more than what I learned in school, and I feel like my skills have improved a lot. I also use my free time to do side projects to improve my skills faster. I spend most of my time learning programming technologies. Currently, I am able to work on any technology that has official documentation, except application development. I also learned the knowledge of using Nodejs and MySQL for back-end development. I also learned the Flutter framework for cross-platform app development, which can save a lot of time for personal projects and is also beneficial to future cooperation. In addition to learning technology, I also like to use my free time to go outdoors. , hiking and fitness, these are my favorite activities now. They strengthen my body and mind, which will help me in my work as a software engineer. I feel comfortable and confident in this field. In the future, I can advance to a higher level in this field, be able to solve various problems, and make better projects for the company. ",
    "school": "Xingguo School of Management | Department of Information Management",
    "skill": [
        "Flutter",
        "iOS",
        "Swift",
        "Objective-C",
        "C#",
        "MS-SQL",
        "Android",
        "Java",
        "Javascript",
        "Nodejs",
        "Vue",
        "MySQL"
    ]
}